INSERT INTO departments(dep_name)
VALUES ('IT-отдел'), ('Бухгалтерия');

INSERT INTO employees (first_name, last_name, patronymic, age,
    birthdate, position, is_remote, address, department_id)
VALUES  ('Александр','Смирнов', 'Александрович', 30, '1990-06-19',
    'Администратор', true, 'тут адрес какой-то', 1),
        ('Дмитрий','Гагарин', 'Романович', 40, '1980-02-27',
    'Программист', true, 'тут адрес какой-то2', 1),
        ('Анна','Иванова', 'Николаевна', 50, '1970-10-24',
    'Бухгалтер', false, 'тут адрес какой-то3', 2);

INSERT INTO work_status_code (code, description)
VALUES  ('Я','Полный день'),
        ('Н','Отсутствие на рабочем месте по невыясненным обстоятельствам'),
        ('В','Выходные и праздничные дни'),
        ('Рв','Работа в праздничные и выходные дни; а также работа в праздничные и выходные дни, при нахождении в командировке;'),
        ('Б','Дни временной нетрудоспособности'),
        ('К','командировочные дни; а также, выходные (нерабочие) дни при нахождении в командировке, когда сотрудник отдыхает, в соответствии с графиком работы ООО «Наука» в командировке'),
        ('ОТ','Ежегодный основной оплаченный отпуск'),
        ('До','Неоплачиваемый отпуск (отпуск за свой счет)'),
        ('Хд','Хозяйственный день'),
        ('У','Отпуск на период обучения'),
        ('Ож','Отпуск по уходу за ребенком');

INSERT INTO employee_date_record (calendar_date, employee_id, code_id)
VALUES  ('2020-05-01', 1, 1),
        ('2020-05-01', 2, 1),
        ('2020-05-02', 1, 2),
        ('2020-05-03', 1, 3),
        ('2020-05-04', 1, 4);